#### 🖌 Terraform Format and Style ->`success`
#### ⚙️ Terraform Initialization ->`success`
#### 📖 Terraform Plan ->`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_integer.env: Refreshing state... [id=8772]
random_uuid.ra_id: Refreshing state... [id=872df478-6ec5-2f04-f3f0-ffd17bfeb1ad]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ContainerRegistry/registries/thns8772default]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.OperationalInsights/workspaces/law-aks-office-hours-default]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ManagedIdentity/userAssignedIdentities/identity-aks-default]
azurerm_role_assignment.acrpull: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ContainerRegistry/registries/thns8772default/providers/Microsoft.Authorization/roleAssignments/872df478-6ec5-2f04-f3f0-ffd17bfeb1ad]
azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourcegroups/rg-aks-office-hours-default/providers/Microsoft.ContainerService/managedClusters/aks-office-hours-default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be destroyed
  - resource "azurerm_container_registry" "acr" {
      - admin_enabled                 = false -> null
      - encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> null
      - georeplication_locations      = [] -> null
      - georeplications               = [] -> null
      - id                            = "/subscriptions/8047fd37-2dc6-4082-bd8b-0da0ab1a24f9/resourceGroups/rg-aks-office-hours-default/providers/Microsoft.ContainerRegistry/registries/thns8772default" -> null
      - location                      = "germanywestcentral" -> null
      - login_server                  = "thns8772default.azurecr.io" -> null
      - name                          = "thns8772default" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "rg-aks-office-hours-default" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Standard" -> null
      - tags                          = {
          - "com.thorsten-hans.conference" = "AKS Office Hours"
          - "com.thorsten-hans.retention"  = "1-month"
        } -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
    }

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + dns_prefix              = "aks-default"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = "1.19.11"
      + location                = "germanywestcentral"
      + name                    = "aks-office-hours-default"
      + node_resource_group     = "rg-aks-office-hours-default-aks"
      + private_cluster_enabled = (known after apply)
      + private_dns_zone_id     = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "rg-aks-office-hours-default"
      + sku_tier                = "Free"
      + tags                    = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }

      + addon_profile {

          + kube_dashboard {
              + enabled = false
            }

          + oms_agent {
              + enabled                    = true
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling  = false
          + max_pods             = (known after apply)
          + name                 = "linux"
          + node_count           = 2
          + node_labels          = {
              + "com.thorsten-hans.purpose" = "general_compute"
            }
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + tags                 = {
              + "com.thorsten-hans.conference" = "AKS Office Hours"
              + "com.thorsten-hans.retention"  = "1-month"
            }
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_D2_v4"
        }

      + identity {
          + principal_id              = (known after apply)
          + tenant_id                 = (known after apply)
          + type                      = "UserAssigned"
          + user_assigned_identity_id = (known after apply)
        }

      + linux_profile {
          + admin_username = "ubuntu"

          + ssh_key {
              + key_data = (sensitive)
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + admin_group_object_ids = (known after apply)
              + azure_rbac_enabled     = (known after apply)
              + client_app_id          = (known after apply)
              + managed                = (known after apply)
              + server_app_id          = (known after apply)
              + server_app_secret      = (sensitive value)
              + tenant_id              = (known after apply)
            }
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + daily_quota_gb             = -1
      + id                         = (known after apply)
      + internet_ingestion_enabled = true
      + internet_query_enabled     = true
      + location                   = "germanywestcentral"
      + name                       = "law-aks-office-hours-default"
      + portal_url                 = (known after apply)
      + primary_shared_key         = (sensitive value)
      + resource_group_name        = "rg-aks-office-hours-default"
      + retention_in_days          = 30
      + secondary_shared_key       = (sensitive value)
      + sku                        = "PerGB2018"
      + tags                       = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + workspace_id               = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "germanywestcentral"
      + name     = "rg-aks-office-hours-default"
      + tags     = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
    }

  # azurerm_role_assignment.acrpull will be created
  + resource "azurerm_role_assignment" "acrpull" {
      + id                               = (known after apply)
      + name                             = "872df478-6ec5-2f04-f3f0-ffd17bfeb1ad"
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "identity-aks-default"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-aks-office-hours-default"
      + tags                = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + tenant_id           = (known after apply)
    }

  # module.myacr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + login_server                  = (known after apply)
      + name                          = "aksofficehours2021"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-aks-office-hours-default"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + tags                          = {
          + "com.thorsten-hans.conference" = "AKS Office Hours"
          + "com.thorsten-hans.retention"  = "1-month"
        }
      + trust_policy                  = (known after apply)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Author: @ThorstenHans, Action: `pull_request`*